In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [1]:
def na_randomfill(series):
    na_mask = pd.isnull(series)   # boolean mask for null values
    n_null = na_mask.sum()        # number of nulls in the Series
    
    # Randomly sample the non-null values from our series
    #  only sample this Series as many times as we have nulls 
    fill_values = series[~na_mask].sample(n=n_null, replace=True, random_state=0)

    # This ensures our new values will replace NaNs in the correct locations
    fill_values.index = series.index[na_mask]
    
    return series.fillna(fill_values)

In [3]:
geo = pd.read_csv('geography.csv')
geo

        post_date state  count_id_indexed
0      2020-03-01   NaN            1.0000
1      2020-03-01    AK            1.0000
2      2020-03-01    AL            1.0000
3      2020-03-01    AR            1.0000
4      2020-03-01    AZ            1.0000
...           ...   ...               ...
34133  2021-09-20    VT            1.2268
34134  2021-09-20    WA            0.9157
34135  2021-09-20    WI            1.1750
34136  2021-09-20    WV            1.1330
34137  2021-09-20    WY            0.8922

[34138 rows x 3 columns]

In [4]:
geo.isnull().sum()/len(geo)

post_date           0.000000
state               0.016609
count_id_indexed    0.000000
dtype: float64

In [5]:
geo['state'].unique()

array([nan, 'AK', 'AL', 'AR', 'AZ', 'CA', 'CO', 'CT', 'DC', 'DE', 'FL',
       'GA', 'HI', 'IA', 'ID', 'IL', 'IN', 'KS', 'KY', 'LA', 'MA', 'MD',
       'ME', 'MI', 'MN', 'MO', 'MS', 'MT', 'NC', 'ND', 'NE', 'NH', 'NJ',
       'NM', 'NV', 'NY', 'OH', 'OK', 'OR', 'PA', 'Pi', 'PR', 'RI', 'SC',
       'SD', 'Sh', 'St', 'TN', 'TX', 'Un', 'UT', 'VA', 'VI', 'VT', 'WA',
       'WI', 'WV', 'WY', 'AS', 'GU', 'Ly', 'MP', 'So', 'ON', 'Ha', 'SK',
       'La', 'AB', 'BS', 'ZH', 'BC', 'Ka', 'MB', 'Ko', 'W', 'N�', 'SP',
       'Ch', 'Be', 'Cu', 'Na', 'Te', 'LU', 'ZG', 'SG', 'UM', 'Bu', '??',
       'KA', 'BW', 'QC', 'EN', 'A', 'TA', 'NS', 'C', 'C ', 'C0', 'CU',
       'JK', '8�', 'BY'], dtype=object)

In [6]:
#null imputation for weird values 
state_codes = pd.read_csv('state-codes.csv').replace('WY ', 'WY')
def fill_state(state):
    if str(state) in np.array(state_codes['Alpha Code']):
        return state
    else:
        return None
geo['state'] = geo['state'].apply(fill_state)

In [7]:
geo['state'].unique()

array([None, 'AK', 'AL', 'AR', 'AZ', 'CA', 'CO', 'CT', 'DE', 'FL', 'GA',
       'HI', 'IA', 'ID', 'IL', 'IN', 'KS', 'KY', 'LA', 'MA', 'MD', 'ME',
       'MI', 'MN', 'MO', 'MS', 'MT', 'NC', 'ND', 'NE', 'NH', 'NJ', 'NM',
       'NV', 'NY', 'OH', 'OK', 'OR', 'PA', 'RI', 'SC', 'SD', 'TN', 'TX',
       'UT', 'VA', 'VT', 'WA', 'WI', 'WV', 'WY'], dtype=object)

In [9]:
geo['state'] = na_randomfill(geo['state'])

In [10]:
geo.isnull().sum()/len(geo)

post_date           0.0
state               0.0
count_id_indexed    0.0
dtype: float64

In [12]:
geo['state'].value_counts()

NJ    715
WI    710
WV    703
AL    702
UT    701
AZ    699
RI    692
MT    691
MD    690
MN    690
MO    690
WA    690
WY    689
ID    688
TX    688
IN    687
GA    686
NE    686
CO    686
MS    685
OH    685
MI    684
NV    684
TN    683
ME    682
VA    681
CA    681
KY    681
HI    681
IL    680
IA    680
NH    680
AR    679
LA    679
SD    679
VT    678
SC    678
NM    678
NY    675
DE    672
FL    671
OR    670
ND    668
CT    668
PA    668
KS    668
OK    666
NC    666
AK    665
MA    660
Name: state, dtype: int64

In [13]:
geo['post_date'] = pd.to_datetime(geo['post_date'])

In [14]:
geo.to_csv('cleaned_geo.csv')

In [48]:
geo_ind = pd.read_csv('geography_industry.csv')
geo_ind

         post_date state        industry  count_id_indexed
0       2020-03-01   NaN             NaN            1.0000
1       2020-03-01   NaN   Communication            1.0000
2       2020-03-01   NaN    Construction            1.0000
3       2020-03-01   NaN          Energy            1.0000
4       2020-03-01   NaN   Entertainment            1.0000
...            ...   ...             ...               ...
546203  2021-09-20    WY     Real Estate            2.8571
546204  2021-09-20    WY          Retail            1.3936
546205  2021-09-20    WY        Services            1.4001
546206  2021-09-20    WY  Transportation            0.4458
546207  2021-09-20    WY       Wholesale            1.1872

[546208 rows x 4 columns]

In [47]:
geo_ind['industry'].value_counts(dropna=False)/len(geo_ind)

Wholesale             0.066920
Manufacturing         0.066780
Services              0.066742
Energy                0.066718
Healthcare            0.066715
Mining                0.066683
Hospitality           0.066674
Retail                0.066658
Entertainment         0.066639
Real Estate           0.066638
Construction          0.066638
Transportation        0.066610
Communication         0.066552
Insurance             0.066519
Financial Services    0.066515
Name: industry, dtype: float64

In [16]:
geo_ind.isnull().sum()/len(geo_ind)

post_date           0.000000
state               0.016609
industry            0.062500
count_id_indexed    0.000000
dtype: float64

In [17]:
geo_ind['state'] = geo_ind['state'].apply(fill_state)
geo_ind['state'] = na_randomfill(geo_ind['state'])
geo_ind['industry'] = na_randomfill(geo_ind['industry'])

In [18]:
geo_ind.isnull().sum()/len(geo_ind)

post_date           0.0
state               0.0
industry            0.0
count_id_indexed    0.0
dtype: float64

In [20]:
geo_ind['industry'].value_counts()

Wholesale             36552
Manufacturing         36476
Services              36455
Energy                36442
Healthcare            36440
Mining                36423
Hospitality           36418
Retail                36409
Entertainment         36399
Real Estate           36398
Construction          36398
Transportation        36383
Communication         36351
Insurance             36333
Financial Services    36331
Name: industry, dtype: int64

In [30]:
geo_ind.to_csv('cleaned_geo_ind.csv')

In [21]:
ind = pd.read_csv('industry.csv')
ind

       post_date        industry  count_id_indexed
0     2020-03-01             NaN            1.0000
1     2020-03-01   Communication            1.0000
2     2020-03-01    Construction            1.0000
3     2020-03-01          Energy            1.0000
4     2020-03-01   Entertainment            1.0000
...          ...             ...               ...
9067  2021-09-20     Real Estate            1.9053
9068  2021-09-20          Retail            2.0609
9069  2021-09-20        Services            1.8623
9070  2021-09-20  Transportation            1.7572
9071  2021-09-20       Wholesale            2.1153

[9072 rows x 3 columns]

In [22]:
ind.isnull().sum()/len(ind)

post_date           0.0000
industry            0.0625
count_id_indexed    0.0000
dtype: float64

In [23]:
ind['industry'] = ind['industry'] = na_randomfill(ind['industry'])
ind['post_date'] = pd.to_datetime(ind['post_date'])

In [24]:
ind.isnull().sum()/len(ind)

post_date           0.0
industry            0.0
count_id_indexed    0.0
dtype: float64

In [31]:
ind.to_csv('cleaned_ind.csv')

In [25]:
ind_fam = pd.read_csv('industry_job_family.csv')
ind_fam

         post_date   industry                    job_family  count_id_indexed
0       2020-03-01        NaN                           NaN            1.0000
1       2020-03-01        NaN              Customer Service            1.0000
2       2020-03-01        NaN  Entertainment and Recreation            1.0000
3       2020-03-01        NaN             Facilities/Constr            1.0000
4       2020-03-01        NaN             Finance/Insurance            1.0000
...            ...        ...                           ...               ...
162774  2021-09-20  Wholesale                         Sales            1.9490
162775  2021-09-20  Wholesale                      Security            7.7942
162776  2021-09-20  Wholesale                Skilled Trades            2.5048
162777  2021-09-20  Wholesale            Supply Chain Staff            2.4621
162778  2021-09-20  Wholesale                    Unassigned            0.4777

[162779 rows x 4 columns]

In [26]:
ind_fam.isnull().sum()/len(ind_fam)

post_date           0.000000
industry            0.065721
job_family          0.050271
count_id_indexed    0.000000
dtype: float64

In [27]:
ind_fam['industry'] = na_randomfill(ind_fam['industry'])
ind_fam['job_family'] = na_randomfill(ind_fam['job_family'])
ind_fam['post_date'] = pd.to_datetime(ind_fam['post_date'])

In [28]:
ind_fam.isnull().sum()/len(ind_fam)

post_date           0.0
industry            0.0
job_family          0.0
count_id_indexed    0.0
dtype: float64

In [32]:
ind_fam.to_csv('cleaned_ind_fam.csv')

In [33]:
fam = pd.read_csv('job_family.csv')
fam

        post_date                    job_family  count_id_indexed
0      2020-03-01                           NaN            1.0000
1      2020-03-01              Customer Service            1.0000
2      2020-03-01  Entertainment and Recreation            1.0000
3      2020-03-01             Facilities/Constr            1.0000
4      2020-03-01             Finance/Insurance            1.0000
...           ...                           ...               ...
10693  2021-09-20                         Sales            1.6536
10694  2021-09-20                      Security            1.7130
10695  2021-09-20                Skilled Trades            2.2378
10696  2021-09-20            Supply Chain Staff            1.7979
10697  2021-09-20                    Unassigned            0.4208

[10698 rows x 3 columns]

In [34]:
fam.isnull().sum()/len(fam)

post_date           0.000000
job_family          0.052627
count_id_indexed    0.000000
dtype: float64

In [35]:
fam['job_family'] = na_randomfill(fam['job_family'])

In [36]:
fam.isnull().sum()/len(fam)

post_date           0.0
job_family          0.0
count_id_indexed    0.0
dtype: float64

In [37]:
fam['job_family'].value_counts()

Entertainment and Recreation      603
Product Management                600
Skilled Trades                    599
Retail Staff                      599
Healthcare                        599
Hospitality Staff                 598
Customer Service                  598
Marketing/Advertising             597
Finance/Insurance                 596
Manufacturing/Operations Staff    595
Supply Chain Staff                595
Security                          595
Food & Beverage                   592
Human Resources                   590
Facilities/Constr                 587
IT                                586
Unassigned                        585
Sales                             584
Name: job_family, dtype: int64

In [38]:
fam.to_csv('cleaned_fam.csv')

In [39]:
fam_role = pd.read_csv('job_family_role.csv')
fam_role

,post_date,job_family,role,count_id_indexed
0,2020-03-01,NaN,EXCUDE,1.0000
1,2020-03-01,Customer Service,Call Center Manager,1.0000
2,2020-03-01,Customer Service,Customer Service Manager,1.0000
3,2020-03-01,Customer Service,Customer Service Representative,1.0000
4,2020-03-01,Customer Service,Customer Support Representative,1.0000
...,...,...,...,...
619914,2021-09-20,Unassigned,Project Coordinator,0.8639
619915,2021-09-20,Unassigned,Project Manager,0.5298
619916,2021-09-20,Unassigned,Shift Manager,2.5717
619917,2021-09-20,Unassigned,Team Member,0.1535
619918,2021-09-20,Unassigned,Vice president,0.4040

In [40]:
fam_role.isnull().sum()/len(fam_role)

post_date           0.000000
job_family          0.000923
role                0.000024
count_id_indexed    0.000000
dtype: float64

In [41]:
fam_role['job_family'] = na_randomfill(fam_role['job_family'])
fam_role['role'] = na_randomfill(fam_role['role'])
fam_role['post_date'] = pd.to_datetime(fam_role['post_date'])

In [42]:
fam_role.isnull().sum()/len(fam_role)

post_date           0.0
job_family          0.0
role                0.0
count_id_indexed    0.0
dtype: float64

In [43]:
fam_role['job_family'].value_counts()

Healthcare                        114630
Finance/Insurance                  96023
Entertainment and Recreation       52713
Manufacturing/Operations Staff     48607
IT                                 44141
Hospitality Staff                  40273
Skilled Trades                     38200
Food & Beverage                    30481
Retail Staff                       27270
Marketing/Advertising              23375
Facilities/Constr                  21292
Human Resources                    20401
Supply Chain Staff                 19290
Unassigned                         18179
Sales                              12151
Security                            5648
Customer Service                    5008
Product Management                  2237
Name: job_family, dtype: int64

In [44]:
fam_role.to_csv('cleaned_fam_role.csv')

In [9]:
overall = pd.read_csv('overall.csv')
overall

      post_date  count_id_indexed
0    2020-03-01            1.0000
1    2020-03-02            1.0100
2    2020-03-03            1.0223
3    2020-03-04            1.0461
4    2020-03-05            1.0582
..          ...               ...
562  2021-09-16            1.9723
563  2021-09-17            1.9826
564  2021-09-18            2.0087
565  2021-09-19            2.0763
566  2021-09-20            1.7846

[567 rows x 2 columns]

In [246]:
overall.isnull().sum()/len(overall)

post_date           0.0
count_id_indexed    0.0
dtype: float64